## Fatiar (slice) Strings

https://pandas.pydata.org/docs/reference/api/pandas.Series.str.slice.html

In [2]:
import pandas as pd

#### Fatiar string python

In [4]:
# lembrando como fatiar string no python
a = 'pyladies pandas'

In [5]:
a[1:4]

'yla'

In [6]:
a[2::2]

'lde ads'

In [7]:
a[1:-2]

'yladies pand'

In [8]:
a[::-1]

'sadnap seidalyp'

atenção!

no python a contagem começa por zero "0"

intervalo fechado no início e aberto no final, ou seja, inclui o valor inicial e não inclui o valor final do intervado

#### Fatiar strings de uma coluna de um DataFrame Pandas

https://pandas.pydata.org/docs/reference/api/pandas.Series.str.slice.html

#### Para usar qualquer método de manipulação de string no pandas, precisamos usar o "Accessor" (acessador) str antes do método

In [9]:
df = pd.DataFrame({
    'nome':['Joana Silva', 'andreA saNtos', 'LeIla BarbOsa'],
    'data_nascimento':['01/04/2001', '05/06/1996', '15/10/1987'],
    'sexo':['feminino', '  feminino', ' feminino  '],
    'cpf':['093.434.324-16', '125.789.674-64', '154.849.764-64']
})
df

            nome data_nascimento         sexo
0    Joana Silva      01/04/2001     feminino
1  andrea santos      05/06/1996     feminino
2  Leila Barbosa      15/10/1987   feminino

#### Utilizando a sintaxe para fatiar strings de uma coluna (series)

In [26]:
df['mês_nascimento'] = df['data_nascimento'].str[3:5]
df

            nome data_nascimento mês_nascimento
0    Joana Silva      01/04/2001             04
1  andrea santos      05/06/1996             06
2  Leila Barbosa      15/10/1987             10

#### Utilizando o método str.sliece para fatiar strings de uma coluna (series)

In [11]:
df['ano'] = df['data_nascimento'].str.slice(start=6, stop=None, step=1)
df

            nome data_nascimento         sexo   ano
0    Joana Silva      01/04/2001     feminino  2001
1  andrea santos      05/06/1996     feminino  1996
2  Leila Barbosa      15/10/1987   feminino    1987

In [14]:
df['data_nascimento'].str.slice(6,None,1)

0    2001
1    1996
2    1987
Name: data_nascimento, dtype: object

### Definir o tipo das letras (case) das strings 

https://pandas.pydata.org/docs/reference/api/pandas.Series.str.title.html

https://pandas.pydata.org/docs/reference/api/pandas.Series.str.lower.html

https://pandas.pydata.org/docs/reference/api/pandas.Series.str.upper.html

https://pandas.pydata.org/docs/reference/api/pandas.Series.str.capitalize.html

https://pandas.pydata.org/docs/reference/api/pandas.Series.str.swapcase.html#

#### Definir tipo de letras em string Python

In [15]:
# relembrar no python
a = "pylaDies salVador"

In [16]:
a.upper()

'PYLADIES SALVADOR'

In [17]:
a.title()

'Pyladies Salvador'

In [18]:
a.lower()

'pyladies salvador'

In [19]:
a.capitalize()

'Pyladies salvador'

#### Definir tipo de letras de strings em uma coluna (series) usando métodos pandas

In [22]:
df = pd.DataFrame({
    'nome':['Joana Silva', 'andreA saNtos', 'LeIla BarbOsa'],
    'data_nascimento':['01/04/2001', '05/06/1996', '15/10/1987'],
    'sexo':['feminino', '  feminino', ' feminino  '],
    'cpf':['093.434.324-16', '125.789.674-64', '154.849.764-64']
})
df

            nome data_nascimento         sexo          cpf
0    Joana Silva      01/04/2001     feminino  09343432416
1  andreA saNtos      05/06/1996     feminino  12578967464
2  LeIla BarbOsa      15/10/1987   feminino    15484976464

In [23]:
# minúsculas
df['nome'].str.lower()

0      joana silva
1    andrea santos
2    leila barbosa
Name: nome, dtype: object

In [24]:
# maiúsculas
df['nome'].str.upper()

0      JOANA SILVA
1    ANDREA SANTOS
2    LEILA BARBOSA
Name: nome, dtype: object

In [25]:
# título
df['nome'].str.title()

0      Joana Silva
1    Andrea Santos
2    Leila Barbosa
Name: nome, dtype: object

In [27]:
# só a primeira letra da frase maiúscula
df['nome'].str.capitalize()

0      Joana silva
1    Andrea santos
2    Leila barbosa
Name: nome, dtype: object

In [28]:
# troca os tipos de letras
df['nome'].str.swapcase()

0      jOANA sILVA
1    ANDREa SAnTOS
2    lEiLA bARBoSA
Name: nome, dtype: object

### Dividir (split) string por um separador
https://pandas.pydata.org/docs/reference/api/pandas.Series.str.split.html

In [29]:
# relembrando no python
a = 'pyladies salvador'

In [30]:
a.split()

['pyladies', 'salvador']

In [31]:
a.split()[0]

'pyladies'

#### dividir stings de uma colouna no pandas usando o método str.split()

In [32]:
df = pd.DataFrame({
    'nome':['Joana Silva', 'andreA saNtos', 'LeIla BarbOsa'],
    'data_nascimento':['01/04/2001', '05/06/1996', '15/10/1987'],
    'sexo':['feminino', '  feminino', ' feminino  '],
    'cpf':['093.434.324-16', '125.789.674-64', '154.849.764-64']
})
df

            nome data_nascimento         sexo             cpf
0    Joana Silva      01/04/2001     feminino  093.434.324-16
1  andreA saNtos      05/06/1996     feminino  125.789.674-64
2  LeIla BarbOsa      15/10/1987   feminino    154.849.764-64

In [33]:
df['nome'].str.split()

0      [Joana, Silva]
1    [andreA, saNtos]
2    [LeIla, BarbOsa]
Name: nome, dtype: object

In [34]:
df['primeiro_nome'] = df['nome'].str.split().str[0]
df

            nome data_nascimento         sexo             cpf primeiro_nome
0    Joana Silva      01/04/2001     feminino  093.434.324-16         Joana
1  andreA saNtos      05/06/1996     feminino  125.789.674-64        andreA
2  LeIla BarbOsa      15/10/1987   feminino    154.849.764-64         LeIla

In [35]:
df['nome'].str.split(expand = True)

        0        1
0   Joana    Silva
1  andreA   saNtos
2   LeIla  BarbOsa

In [36]:
df[['primeiro_nome','sobrenome']] = df['nome'].str.split(expand = True)
df

,nome,data_nascimento,sexo,cpf,primeiro_nome,sobrenome
0,Joana Silva,01/04/2001,feminino,093.434.324-16,Joana,Silva
1,andreA saNtos,05/06/1996,feminino,125.789.674-64,andreA,saNtos
2,LeIla BarbOsa,15/10/1987,feminino,154.849.764-64,LeIla,BarbOsa

In [37]:
df['data_nascimento'].str.split()

0    [01/04/2001]
1    [05/06/1996]
2    [15/10/1987]
Name: data_nascimento, dtype: object

In [38]:
df['data_nascimento'].str.split('/')

0    [01, 04, 2001]
1    [05, 06, 1996]
2    [15, 10, 1987]
Name: data_nascimento, dtype: object

In [39]:
df['data_nascimento'].str.split('/', expand = True, n = 1)

    0        1
0  01  04/2001
1  05  06/1996
2  15  10/1987

In [41]:
df['mês_ano'] = df['data_nascimento'].str.split('/', expand = True, n =1)[1]
df

,nome,data_nascimento,sexo,cpf,primeiro_nome,sobrenome,mês_ano
0,Joana Silva,01/04/2001,feminino,093.434.324-16,Joana,Silva,04/2001
1,andreA saNtos,05/06/1996,feminino,125.789.674-64,andreA,saNtos,06/1996
2,LeIla BarbOsa,15/10/1987,feminino,154.849.764-64,LeIla,BarbOsa,10/1987

In [43]:
df['data_nascimento'].str.split('/', n =1).str[1]

0    04/2001
1    06/1996
2    10/1987
Name: data_nascimento, dtype: object

### Substituir caracteres de strings de uma coluna

https://pandas.pydata.org/docs/reference/api/pandas.Series.str.replace.html

https://pandas.pydata.org/docs/reference/api/pandas.Series.str.slice_replace.html

#### Substituir caractere de string em python

In [44]:
a = "Pyladies Salvador"

In [46]:
a.replace("P","z")

'zyladies Salvador'

#### Substituir caracters de strings de uma coluna usando o método str.replace()

In [47]:
df = pd.DataFrame({
    'nome':['Joana Silva', 'andreA saNtos', 'LeIla BarbOsa'],
    'data_nascimento':['01/04/2001', '05/06/1996', '15/10/1987'],
    'sexo':['feminino', '  feminino', ' feminino  '],
    'cpf':['093.434.324-16', '125.789.674-64', '154.849.764-64']
})
df

            nome data_nascimento         sexo             cpf
0    Joana Silva      01/04/2001     feminino  093.434.324-16
1  andreA saNtos      05/06/1996     feminino  125.789.674-64
2  LeIla BarbOsa      15/10/1987   feminino    154.849.764-64

In [48]:
df['data_nascimento'].str.replace('/','-')

0    01-04-2001
1    05-06-1996
2    15-10-1987
Name: data_nascimento, dtype: object

In [53]:
df['cpf'].str.replace(".","", regex = False).str.replace("-","", regex = False)

0    09343432416
1    12578967464
2    15484976464
Name: cpf, dtype: object

#### Substituir "fatia" de strings de uma coluna usando o método str.slice_replace()

In [93]:
df['cpf'].str.slice_replace(start = 4, stop = 11, repl = 'xxx.xxx')

0    093.xxx.xxx-16
1    125.xxx.xxx-64
2    154.xxx.xxx-64
Name: cpf, dtype: object

### Remover caracteres finais e/ou iniciais (strip) de strings em coluna (series)
https://pandas.pydata.org/docs/reference/api/pandas.Series.str.strip.html

https://pandas.pydata.org/docs/reference/api/pandas.Series.str.rstrip.html

https://pandas.pydata.org/docs/reference/api/pandas.Series.str.lstrip.html

#### Remover caracteres finais e/ou iniciais de uma string python

In [65]:
a = "   test test "
a

'   test test '

In [66]:
a.strip()

'test test'

In [67]:
a.strip(" t")

'est tes'

In [68]:
a.lstrip(" t")

'est test '

In [69]:
a.rstrip(" t")

'   test tes'

In [82]:
a.strip(" tes")

''

#### Remover caracteres finais e/ou iniciais (strip) de strings em coluna (series) usando métodos str.strip(), str.rstrip() e str.lstrip()

In [85]:
df = pd.DataFrame({
    'nome':['Joana Silva', 'andreA saNtos', 'LeIla BarbOsa'],
    'data_nascimento':['01/04/2001', '05/06/1996', '15/10/1987'],
    'sexo':['feminino', '  feminino', ' feminino  '],
    'cpf':['093.434.324-16', '125.789.674-64', '154.849.764-64']
})
df

            nome data_nascimento         sexo             cpf
0  Joana\n Silva      01/04/2001     feminino  093.434.324-16
1  andreA saNtos      05/06/1996     feminino  125.789.674-64
2  LeIla BarbOsa      15/10/1987   feminino    154.849.764-64

In [71]:
df['sexo'].unique()

array(['feminino', '  feminino', ' feminino  '], dtype=object)

In [73]:
df['sexo'].str.strip().unique()

array(['feminino'], dtype=object)

In [74]:
df['sexo'].str.strip(' f')

0    eminino
1    eminino
2    eminino
Name: sexo, dtype: object

In [76]:
# remove caracteres definidos do início e do final da string
df['nome'].str.strip('a')

0      Joana Silv
1    ndreA saNtos
2    LeIla BarbOs
Name: nome, dtype: object

In [78]:
# remove caracteres definidos apenas do início da string
df['nome'].str.lstrip('a')

0      Joana Silva
1     ndreA saNtos
2    LeIla BarbOsa
Name: nome, dtype: object

In [83]:
# remove caracteres defenidos apenas do final da string
df['nome'].str.rstrip('a')

0       Joana Silv
1    andreA saNtos
2     LeIla BarbOs
Name: nome, dtype: object

In [84]:
df['nome'].str.rstrip('sa')

0      Joana Silv
1    andreA saNto
2     LeIla BarbO
Name: nome, dtype: object